package com.example.study_kotlin2.ChapterMemo;

/*
Chapter 8
UI 프래그먼트와 프래그먼트 매니저

UI 유연성의 필요
- List-Detail 로 이루어진 앱에서 리스트를 보여주고 리스트를 클릭하게 되면 상세 정보를 띄어주는 앱이 있다고 하자.
- 만약 이 앱을 화면이 큰 장치에서 실행시킨다고 했을 경우 가로 방향에서 리스트와 디테일을 동시에 보여줄 만큼 화면이 충분히 크거나.
(원래대로 라면)                   (큰 화면에서)
리스트 화면 -> 디테일 화면          리스트 + 디테일
- 또는 사용자가 한 범죄의 상세 내역을 보면서 리스트의 다음 범죄를 보기 원한다고 했을 대 백 버튼을 눌러서 리스트 화면으로 가는 것 대신
곧바로 리스에서 다른 범죄를 선택할 수 있다면 좋을 것이다.
- UI 유연성이란, 사용자나 장치가 요구하는 것에 따라 런타임 시에 액티비티의 뷰를 구성하거나 변경할 수 있는 능력이다.
- 하지만 액티비티는 이런 유연성을 제공하도록 설계되지 않았다.
- 액티비티의 뷰들은 런타임 시에 변경되며














 */
